{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2000, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "trainable": true, "n": 10}, "inbound_nodes": [[["input_3", 0, 0, {}]], [["lstm_2", 0, 1, {}]], [["lstm_2", 1, 1, {}]], [["lstm_2", 2, 1, {}]], [["lstm_2", 3, 1, {}]], [["lstm_2", 4, 1, {}]], [["lstm_2", 5, 1, {}]], [["lstm_2", 6, 1, {}]], [["lstm_2", 7, 1, {}]], [["lstm_2", 8, 1, {}]], [["lstm_2", 9, 1, {}]], [["lstm_2", 10, 1, {}]], [["lstm_2", 11, 1, {}]], [["lstm_2", 12, 1, {}]], [["lstm_2", 13, 1, {}]], [["lstm_2", 14, 1, {}]], [["lstm_2", 15, 1, {}]], [["lstm_2", 16, 1, {}]], [["lstm_2", 17, 1, {}]], [["lstm_2", 18, 1, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 0, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 1, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 2, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 3, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 4, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 5, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 6, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 7, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 8, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 9, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 10, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 11, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 12, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 13, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 14, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 15, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 16, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 17, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 18, 0, {}]], [["bidirectional_1", 0, 0, {}], ["repeat_vector_1", 19, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 24, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]], [["concatenate_1", 1, 0, {}]], [["concatenate_1", 2, 0, {}]], [["concatenate_1", 3, 0, {}]], [["concatenate_1", 4, 0, {}]], [["concatenate_1", 5, 0, {}]], [["concatenate_1", 6, 0, {}]], [["concatenate_1", 7, 0, {}]], [["concatenate_1", 8, 0, {}]], [["concatenate_1", 9, 0, {}]], [["concatenate_1", 10, 0, {}]], [["concatenate_1", 11, 0, {}]], [["concatenate_1", 12, 0, {}]], [["concatenate_1", 13, 0, {}]], [["concatenate_1", 14, 0, {}]], [["concatenate_1", 15, 0, {}]], [["concatenate_1", 16, 0, {}]], [["concatenate_1", 17, 0, {}]], [["concatenate_1", 18, 0, {}]], [["concatenate_1", 19, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]], [["dense_1", 2, 0, {}]], [["dense_1", 3, 0, {}]], [["dense_1", 4, 0, {}]], [["dense_1", 5, 0, {}]], [["dense_1", 6, 0, {}]], [["dense_1", 7, 0, {}]], [["dense_1", 8, 0, {}]], [["dense_1", 9, 0, {}]], [["dense_1", 10, 0, {}]], [["dense_1", 11, 0, {}]], [["dense_1", 12, 0, {}]], [["dense_1", 13, 0, {}]], [["dense_1", 14, 0, {}]], [["dense_1", 15, 0, {}]], [["dense_1", 16, 0, {}]], [["dense_1", 17, 0, {}]], [["dense_1", 18, 0, {}]], [["dense_1", 19, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "softmax_1", "class_name": "Softmax", "config": {"name": "softmax_1", "trainable": true, "axis": 1}, "inbound_nodes": [[["dense_2", 0, 0, {}]], [["dense_2", 1, 0, {}]], [["dense_2", 2, 0, {}]], [["dense_2", 3, 0, {}]], [["dense_2", 4, 0, {}]], [["dense_2", 5, 0, {}]], [["dense_2", 6, 0, {}]], [["dense_2", 7, 0, {}]], [["dense_2", 8, 0, {}]], [["dense_2", 9, 0, {}]], [["dense_2", 10, 0, {}]], [["dense_2", 11, 0, {}]], [["dense_2", 12, 0, {}]], [["dense_2", 13, 0, {}]], [["dense_2", 14, 0, {}]], [["dense_2", 15, 0, {}]], [["dense_2", 16, 0, {}]], [["dense_2", 17, 0, {}]], [["dense_2", 18, 0, {}]], [["dense_2", 19, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2072, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dot_1", "class_name": "Dot", "config": {"name": "dot_1", "trainable": true, "axes": 1, "normalize": false}, "inbound_nodes": [[["softmax_1", 0, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 1, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 2, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 3, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 4, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 5, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 6, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 7, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 8, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 9, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 10, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 11, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 12, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 13, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 14, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 15, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 16, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 17, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 18, 0, {}], ["bidirectional_1", 0, 0, {}]], [["softmax_1", 19, 0, {}], ["bidirectional_1", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": 2}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["lambda_1", 0, 0, {}]], [["dot_1", 1, 0, {}], ["lambda_2", 0, 0, {}]], [["dot_1", 2, 0, {}], ["lambda_3", 0, 0, {}]], [["dot_1", 3, 0, {}], ["lambda_4", 0, 0, {}]], [["dot_1", 4, 0, {}], ["lambda_5", 0, 0, {}]], [["dot_1", 5, 0, {}], ["lambda_6", 0, 0, {}]], [["dot_1", 6, 0, {}], ["lambda_7", 0, 0, {}]], [["dot_1", 7, 0, {}], ["lambda_8", 0, 0, {}]], [["dot_1", 8, 0, {}], ["lambda_9", 0, 0, {}]], [["dot_1", 9, 0, {}], ["lambda_10", 0, 0, {}]], [["dot_1", 10, 0, {}], ["lambda_11", 0, 0, {}]], [["dot_1", 11, 0, {}], ["lambda_12", 0, 0, {}]], [["dot_1", 12, 0, {}], ["lambda_13", 0, 0, {}]], [["dot_1", 13, 0, {}], ["lambda_14", 0, 0, {}]], [["dot_1", 14, 0, {}], ["lambda_15", 0, 0, {}]], [["dot_1", 15, 0, {}], ["lambda_16", 0, 0, {}]], [["dot_1", 16, 0, {}], ["lambda_17", 0, 0, {}]], [["dot_1", 17, 0, {}], ["lambda_18", 0, 0, {}]], [["dot_1", 18, 0, {}], ["lambda_19", 0, 0, {}]], [["dot_1", 19, 0, {}], ["lambda_20", 0, 0, {}]]]}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["input_3", 0, 0, {}], ["input_4", 0, 0, {}]], [["concatenate_2", 1, 0, {}], ["lstm_2", 0, 1, {}], ["lstm_2", 0, 2, {}]], [["concatenate_2", 2, 0, {}], ["lstm_2", 1, 1, {}], ["lstm_2", 1, 2, {}]], [["concatenate_2", 3, 0, {}], ["lstm_2", 2, 1, {}], ["lstm_2", 2, 2, {}]], [["concatenate_2", 4, 0, {}], ["lstm_2", 3, 1, {}], ["lstm_2", 3, 2, {}]], [["concatenate_2", 5, 0, {}], ["lstm_2", 4, 1, {}], ["lstm_2", 4, 2, {}]], [["concatenate_2", 6, 0, {}], ["lstm_2", 5, 1, {}], ["lstm_2", 5, 2, {}]], [["concatenate_2", 7, 0, {}], ["lstm_2", 6, 1, {}], ["lstm_2", 6, 2, {}]], [["concatenate_2", 8, 0, {}], ["lstm_2", 7, 1, {}], ["lstm_2", 7, 2, {}]], [["concatenate_2", 9, 0, {}], ["lstm_2", 8, 1, {}], ["lstm_2", 8, 2, {}]], [["concatenate_2", 10, 0, {}], ["lstm_2", 9, 1, {}], ["lstm_2", 9, 2, {}]], [["concatenate_2", 11, 0, {}], ["lstm_2", 10, 1, {}], ["lstm_2", 10, 2, {}]], [["concatenate_2", 12, 0, {}], ["lstm_2", 11, 1, {}], ["lstm_2", 11, 2, {}]], [["concatenate_2", 13, 0, {}], ["lstm_2", 12, 1, {}], ["lstm_2", 12, 2, {}]], [["concatenate_2", 14, 0, {}], ["lstm_2", 13, 1, {}], ["lstm_2", 13, 2, {}]], [["concatenate_2", 15, 0, {}], ["lstm_2", 14, 1, {}], ["lstm_2", 14, 2, {}]], [["concatenate_2", 16, 0, {}], ["lstm_2", 15, 1, {}], ["lstm_2", 15, 2, {}]], [["concatenate_2", 17, 0, {}], ["lstm_2", 16, 1, {}], ["lstm_2", 16, 2, {}]], [["concatenate_2", 18, 0, {}], ["lstm_2", 17, 1, {}], ["lstm_2", 17, 2, {}]], [["concatenate_2", 19, 0, {}], ["lstm_2", 18, 1, {}], ["lstm_2", 18, 2, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_7", "class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_8", "class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_9", "class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_10", "class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_11", "class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_12", "class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_13", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_14", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcxgAAAB8AGQAZACFAogAiABkARcAhQJmAhkAUwApAk7pAQAA\nAKkAKQHaAXgpAdoCdHlyAgAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxs\nYW1iZGE+pQAAAPMAAAAA\n", null, [19]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 2072, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_2", 0, 0, {}]], [["lstm_2", 1, 0, {}]], [["lstm_2", 2, 0, {}]], [["lstm_2", 3, 0, {}]], [["lstm_2", 4, 0, {}]], [["lstm_2", 5, 0, {}]], [["lstm_2", 6, 0, {}]], [["lstm_2", 7, 0, {}]], [["lstm_2", 8, 0, {}]], [["lstm_2", 9, 0, {}]], [["lstm_2", 10, 0, {}]], [["lstm_2", 11, 0, {}]], [["lstm_2", 12, 0, {}]], [["lstm_2", 13, 0, {}]], [["lstm_2", 14, 0, {}]], [["lstm_2", 15, 0, {}]], [["lstm_2", 16, 0, {}]], [["lstm_2", 17, 0, {}]], [["lstm_2", 18, 0, {}]], [["lstm_2", 19, 0, {}]]]}, {"name": "lambda_21", "class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxQAAAB0AGoBdACgAnwAoQFkAWQCjQJTACkDTikD6QEAAADp\nAAAAAOkCAAAAKQHaB3BhdHRlcm4pA9oBS9oScGVybXV0ZV9kaW1lbnNpb25z2gVzdGFjaykB2gF4\nqQByCQAAAPogRDpcUHJvamVjdHNcVHJhbnNsYXRvclxtb2RlbHMucHnaCDxsYW1iZGE+rAAAAPMA\nAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_3", 1, 0, {}], ["dense_3", 2, 0, {}], ["dense_3", 3, 0, {}], ["dense_3", 4, 0, {}], ["dense_3", 5, 0, {}], ["dense_3", 6, 0, {}], ["dense_3", 7, 0, {}], ["dense_3", 8, 0, {}], ["dense_3", 9, 0, {}], ["dense_3", 10, 0, {}], ["dense_3", 11, 0, {}], ["dense_3", 12, 0, {}], ["dense_3", 13, 0, {}], ["dense_3", 14, 0, {}], ["dense_3", 15, 0, {}], ["dense_3", 16, 0, {}], ["dense_3", 17, 0, {}], ["dense_3", 18, 0, {}], ["dense_3", 19, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["lambda_21", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}